SpenceKonde/megaTinyCore/megaavr/boards.txt
##############################################################

atxy6o.name=ATtiny3216/1616/1606/816/806/416/406 (optiboot)
atxy6o.upload.speed=115200

atxy6o.menu.chip.3216=ATtiny3216
atxy6o.menu.chip.3216.build.mcu=attiny3216
atxy6o.menu.chip.3216.upload.maximum_size=32768
atxy6o.menu.chip.3216.upload.maximum_data_size=2048
atxy6o.menu.chip.1616=ATtiny1616
atxy6o.menu.chip.1616.build.mcu=attiny1616
atxy6o.menu.chip.1616.upload.maximum_size=16384
atxy6o.menu.chip.1616.upload.maximum_data_size=2048
atxy6o.menu.chip.816=ATtiny816
atxy6o.menu.chip.816.build.mcu=attiny816
atxy6o.menu.chip.816.upload.maximum_size=8192
atxy6o.menu.chip.816.upload.maximum_data_size=512
atxy6o.menu.chip.416=ATtiny416
atxy6o.menu.chip.416.build.mcu=attiny416
atxy6o.menu.chip.416.upload.maximum_size=4096
atxy6o.menu.chip.416.upload.maximum_data_size=256

atxy6o.menu.chip.1606=ATtiny1606
atxy6o.menu.chip.1606.build.mcu=attiny1606
atxy6o.menu.chip.1606.upload.maximum_size=16384
atxy6o.menu.chip.1606.upload.maximum_data_size=1024
atxy6o.menu.chip.806=ATtiny806
atxy6o.menu.chip.806.build.mcu=attiny806
atxy6o.menu.chip.806.upload.maximum_size=8192
atxy6o.menu.chip.806.upload.maximum_data_size=512
atxy6o.menu.chip.406=ATtiny406
atxy6o.menu.chip.406.build.mcu=attiny406
atxy6o.menu.chip.406.upload.maximum_size=4096
atxy6o.menu.chip.406.upload.maximum_data_size=256

atxy6o.menu.clock.20=20 MHz
atxy6o.menu.clock.16=16 MHz
atxy6o.menu.clock.10=10 MHz
atxy6o.menu.clock.8=8 MHz
atxy6o.menu.clock.5=5 MHz
atxy6o.menu.clock.4=4 MHz
atxy6o.menu.clock.1=1 MHz
atxy6o.menu.clock.20.build.f_cpu=20000000L
atxy6o.menu.clock.16.build.f_cpu=16000000L
atxy6o.menu.clock.10.build.f_cpu=10000000L
atxy6o.menu.clock.8.build.f_cpu=8000000L
atxy6o.menu.clock.5.build.f_cpu=5000000L
atxy6o.menu.clock.4.build.f_cpu=4000000L
atxy6o.menu.clock.1.build.f_cpu=1000000L

atxy6o.menu.dacvref.0v55=0.55V
atxy6o.menu.dacvref.1v1=1.10V
atxy6o.menu.dacvref.1v5=1.50V
atxy6o.menu.dacvref.2v5=2.50V
atxy6o.menu.dacvref.4v3=4.30V
atxy6o.menu.dacvref.0v55.build.dacvref=-DDACVREF=0
atxy6o.menu.dacvref.1v1.build.dacvref=-DDACVREF=1
atxy6o.menu.dacvref.1v5.build.dacvref=-DDACVREF=4
atxy6o.menu.dacvref.2v5.build.dacvref=-DDACVREF=2
atxy6o.menu.dacvref.4v3.build.dacvref=-DDACVREF=3

atxy6o.menu.millis.enabled=Enabled
atxy6o.menu.millis.disabled=Disabled (saves flash)
atxy6o.menu.millis.enabled.build.millis=
atxy6o.menu.millis.disabled.build.millis=-DDISABLEMILLIS

atxy6o.menu.neopixelport.porta=PORTA (pins 0~3,14~17)
atxy6o.menu.neopixelport.portb=PORTB (pins 4~9)
atxy6o.menu.neopixelport.portc=PORTC (pins 10~13)
atxy6o.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=VPORTA.OUT
atxy6o.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=VPORTB.OUT
atxy6o.menu.neopixelport.portc.build.neopixelport=-DNEOPIXELPORT=VPORTC.OUT

atxy6o.upload.tool=avrdude

atxy6o.build.board=attinyxy6
atxy6o.build.core=arduino
atxy6o.build.variant=txy6
atxy6o.build.text_section_start=.text=0x0
atxy6o.build.extra_flags=-DMILLIS_USE_TIMERA0 -DNO_EXTERNAL_I2C_PULLUP -DUSE_TIMERD0_PWM {build.dacvref} {build.neopixelport} {build.millis}
atxy6o.build.export_merged_output=false

atxy6o.upload.workaround=

atxy6o.upload.protocol=arduino
atxy6o.upload.extra_params=-D
atxy6o.build.text_section_start=.text=0x200
atxy6o.bootloader.file=optiboot_x/optiboot_txy6o.hex
atxy6o.bootloader.BOOTEND=0x2
atxy6o.bootloader.tool=avrdude

##############################################################

atxy4o.name=ATtiny1614/1604/814/804/414/404/214/204 (optiboot)
atxy4o.upload.speed=115200

atxy4o.menu.chip.1614=ATtiny1614
atxy4o.menu.chip.1614.build.mcu=attiny1614
atxy4o.menu.chip.1614.upload.maximum_size=16384
atxy4o.menu.chip.1614.upload.maximum_data_size=2048
atxy4o.menu.chip.814=ATtiny814
atxy4o.menu.chip.814.build.mcu=attiny814
atxy4o.menu.chip.814.upload.maximum_size=8192
atxy4o.menu.chip.814.upload.maximum_data_size=512
atxy4o.menu.chip.414=ATtiny414
atxy4o.menu.chip.414.build.mcu=attiny414
atxy4o.menu.chip.414.upload.maximum_size=4096
atxy4o.menu.chip.414.upload.maximum_data_size=256
atxy4o.menu.chip.214=ATtiny214
atxy4o.menu.chip.214.build.mcu=attiny214
atxy4o.menu.chip.214.upload.maximum_size=2048
atxy4o.menu.chip.214.upload.maximum_data_size=128
atxy4o.menu.chip.1604=ATtiny1604
atxy4o.menu.chip.1604.build.mcu=attiny1604
atxy4o.menu.chip.1604.upload.maximum_size=16384
atxy4o.menu.chip.1604.upload.maximum_data_size=1024
atxy4o.menu.chip.804=ATtiny804
atxy4o.menu.chip.804.build.mcu=attiny804
atxy4o.menu.chip.804.upload.maximum_size=8192
atxy4o.menu.chip.804.upload.maximum_data_size=512
atxy4o.menu.chip.404=ATtiny404
atxy4o.menu.chip.404.build.mcu=attiny404
atxy4o.menu.chip.404.upload.maximum_size=4096
atxy4o.menu.chip.404.upload.maximum_data_size=256
atxy4o.menu.chip.204=ATtiny204
atxy4o.menu.chip.204.build.mcu=attiny204
atxy4o.menu.chip.204.upload.maximum_size=2048
atxy4o.menu.chip.204.upload.maximum_data_size=128

atxy4o.menu.clock.20=20 MHz
atxy4o.menu.clock.16=16 MHz
atxy4o.menu.clock.10=10 MHz
atxy4o.menu.clock.8=8 MHz
atxy4o.menu.clock.5=5 MHz
atxy4o.menu.clock.4=4 MHz
atxy4o.menu.clock.1=1 MHz
atxy4o.menu.clock.20.build.f_cpu=20000000L
atxy4o.menu.clock.16.build.f_cpu=16000000L
atxy4o.menu.clock.10.build.f_cpu=10000000L
atxy4o.menu.clock.8.build.f_cpu=8000000L
atxy4o.menu.clock.5.build.f_cpu=5000000L
atxy4o.menu.clock.4.build.f_cpu=4000000L
atxy4o.menu.clock.1.build.f_cpu=1000000L
atxy4o.menu.clock.20.bootloader.OSCCFG=0x02
atxy4o.menu.clock.16.bootloader.OSCCFG=0x01
atxy4o.menu.clock.10.bootloader.OSCCFG=0x02
atxy4o.menu.clock.8.bootloader.OSCCFG=0x01
atxy4o.menu.clock.5.bootloader.OSCCFG=0x02
atxy4o.menu.clock.4.bootloader.OSCCFG=0x01
atxy4o.menu.clock.1.bootloader.OSCCFG=0x01

atxy4o.menu.dacvref.0v55=0.55V
atxy4o.menu.dacvref.1v1=1.10V
atxy4o.menu.dacvref.1v5=1.50V
atxy4o.menu.dacvref.2v5=2.50V
atxy4o.menu.dacvref.4v3=4.30V
atxy4o.menu.dacvref.0v55.build.dacvref=-DDACVREF=0
atxy4o.menu.dacvref.1v1.build.dacvref=-DDACVREF=1
atxy4o.menu.dacvref.1v5.build.dacvref=-DDACVREF=4
atxy4o.menu.dacvref.2v5.build.dacvref=-DDACVREF=2
atxy4o.menu.dacvref.4v3.build.dacvref=-DDACVREF=3

atxy4o.menu.millis.enabled=Enabled
atxy4o.menu.millis.disabled=Disabled (saves flash)
atxy4o.menu.millis.enabled.build.millis=
atxy4o.menu.millis.disabled.build.millis=-DDISABLEMILLIS

